[Killed] EqualityOperator
backend/controllers/orderController.js:18:21
     totalPrice,
   } = req.body
 
-  if (orderItems && orderItems.length === 0) {
+  if (orderItems && orderItems.length !== 0) {
     res.status(400)
     throw new Error('No order items')
killedBy: All tests
statusReason: (node:9584) ExperimentalWarning: Module mocking is an experimental feature and might change at any time
(Use `node --trace-warnings ...` to show where the warning was created)

✖ addOrderItems: valid cart -> 201 with persisted order body (4.12ms)
✖ addOrderItems: orderItems:[] -> 400 "No order items", no save (0.6206ms)

✖ addOrderItems: client-supplied totalPrice 0.01 is persisted verbatim (0.5

[Killed] ConditionalExpression
backend/controllers/orderController.js:18:7
     totalPrice,
   } = req.body
 
-  if (orderItems && orderItems.length === 0) {
+  if (false) {
     res.status(400)
     throw new Error('No order items')
killedBy: All tests
statusReason: (node:6888) ExperimentalWarning: Module mocking is an experimental feature and might change at any time
(Use `node --trace-warnings ...` to show where the warning was created)

✔ addOrderItems: valid cart -> 201 with persisted order body (2.1844ms)

✖ addOrderItems: orderItems:[] -> 400 "No order items", no save (1.238ms)

✔ addOrderItems: client-supplied totalPrice 0.01 is persisted verbatim (

[Killed] StringLiteral
backend/controllers/orderController.js:20:21
 
   if (orderItems && orderItems.length === 0) {
     res.status(400)
-    throw new Error('No order items')
+    throw new Error("")
     return
   } else {
killedBy: All tests
statusReason: (node:6068) ExperimentalWarning: Module mocking is an experimental feature and might change at any time
(Use `node --trace-warnings ...` to show where the warning was created)

✔ addOrderItems: valid cart -> 201 with persisted order body (2.2012ms)

✖ addOrderItems: orderItems:[] -> 400 "No order items", no save (1.4712ms)

✔ addOrderItems: client-supplied totalPrice 0.01 is persisted verbatim

[Killed] BlockStatement
backend/controllers/orderController.js:22:10
     res.status(400)
     throw new Error('No order items')
     return
-  } else {
-    const order = new Order({
-      orderItems,
-      user: req.user._id,
-      shippingAddress,
-      paymentMethod,
-      itemsPrice,
-      taxPrice,
-      shippingPrice,
-      totalPrice,
-    })
-
-    const createdOrder = await order.save()
-
-    res.status(201).json(createdOrder)
-  }
+  } else {}
 })
 
killedBy: All tests
statusReason: (node:17640) ExperimentalWarning: Module mocking is an experimental feature and might change at any time
(Use `node --trace-warnings ...` to show where the warning was created)

✖ addOrderItems: valid cart -> 201 with persisted order body (2.5797ms)

✔ addOrderItems: orderItems:[] -> 400 "No order items", no save (0.4239ms)

✖ addOrderItems: client-supplied totalPrice 0.01 is persisted verbatim

[Killed] BlockStatement
backend/controllers/orderController.js:43:55
 // @desc    Get order by ID
 // @route   GET /api/orders/:id
 // @access  Private
-const getOrderById = asyncHandler(async (req, res) => {
-  const order = await Order.findById(req.params.id).populate(
-    'user',
-    'name email'
-  )
-
-  if (order) {
-    const ownerId = order.user._id ? order.user._id : order.user
-    if (ownerId.toString() !== req.user._id.toString() && !req.user.isAdmin) {
-      res.status(403)
-      throw new Error('Not authorized to view this order')
-    }
-    res.json(order)
-  } else {
-    res.status(404)
-    throw new Error('Order not found')
-  }
-})
+const getOrderById = asyncHandler(async (req, res) => {})
 
 // @desc    Update order to paid
killedBy: All tests
statusReason: (node:3016) ExperimentalWarning: Module mocking is an experimental feature and might change at any time
(Use `node --trace-warnings ...` to show where the warning was created)

✔ addOrderItems: valid cart -> 201 with persisted order body (1.9962ms)

✔ addOrderItems: orderItems:[] -> 400 "No order items", no save (0.3664ms)

✔ addOrderItems: client-supplied totalPrice 0.01 is persisted verbatim

[Killed] BlockStatement
backend/controllers/orderController.js:49:14
     'name email'
   )
 
-  if (order) {
-    const ownerId = order.user._id ? order.user._id : order.user
-    if (ownerId.toString() !== req.user._id.toString() && !req.user.isAdmin) {
-      res.status(403)
-      throw new Error('Not authorized to view this order')
-    }
-    res.json(order)
-  } else {
+  if (order) {} else {
     res.status(404)
     throw new Error('Order not found')
killedBy: All tests
statusReason: (node:28312) ExperimentalWarning: Module mocking is an experimental feature and might change at any time
(Use `node --trace-warnings ...` to show where the warning was created)

✔ addOrderItems: valid cart -> 201 with persisted order body (1.9805ms)

✔ addOrderItems: orderItems:[] -> 400 "No order items", no save (0.3536ms)

✔ addOrderItems: client-supplied totalPrice 0.01 is persisted verbatim

[Killed] ConditionalExpression
backend/controllers/orderController.js:49:7
     'name email'
   )
 
-  if (order) {
+  if (true) {
     const ownerId = order.user._id ? order.user._id : order.user
     if (ownerId.toString() !== req.user._id.toString() && !req.user.isAdmin) {
killedBy: All tests
statusReason: (node:22272) ExperimentalWarning: Module mocking is an experimental feature and might change at any time
(Use `node --trace-warnings ...` to show where the warning was created)

✔ addOrderItems: valid cart -> 201 with persisted order body (3.2847ms)

✔ addOrderItems: orderItems:[] -> 400 "No order items", no save (0.3867ms)
✔ addOrderItems: client-supplied totalPrice 0.01 is persisted verbatim (

[Killed] ConditionalExpression
backend/controllers/orderController.js:51:9
 
   if (order) {
     const ownerId = order.user._id ? order.user._id : order.user
-    if (ownerId.toString() !== req.user._id.toString() && !req.user.isAdmin) {
+    if (true) {
       res.status(403)
       throw new Error('Not authorized to view this order')
killedBy: All tests
statusReason: (node:18764) ExperimentalWarning: Module mocking is an experimental feature and might change at any time
(Use `node --trace-warnings ...` to show where the warning was created)

✔ addOrderItems: valid cart -> 201 with persisted order body (2.0452ms)

✔ addOrderItems: orderItems:[] -> 400 "No order items", no save (0.4002ms)

✔ addOrderItems: client-supplied totalPrice 0.01 is persisted verbatim

[Killed] ConditionalExpression
backend/controllers/orderController.js:51:9
 
   if (order) {
     const ownerId = order.user._id ? order.user._id : order.user
-    if (ownerId.toString() !== req.user._id.toString() && !req.user.isAdmin) {
+    if (true && !req.user.isAdmin) {
       res.status(403)
       throw new Error('Not authorized to view this order')
killedBy: All tests
statusReason: (node:28816) ExperimentalWarning: Module mocking is an experimental feature and might change at any time
(Use `node --trace-warnings ...` to show where the warning was created)

✔ addOrderItems: valid cart -> 201 with persisted order body (1.9271ms)

✔ addOrderItems: orderItems:[] -> 400 "No order items", no save (0.4424ms)

✔ addOrderItems: client-supplied totalPrice 0.01 is persisted verbatim

[Killed] StringLiteral
backend/controllers/orderController.js:53:23
     const ownerId = order.user._id ? order.user._id : order.user
     if (ownerId.toString() !== req.user._id.toString() && !req.user.isAdmin) {
       res.status(403)
-      throw new Error('Not authorized to view this order')
+      throw new Error("")
     }
     res.json(order)
killedBy: All tests
statusReason: (node:2304) ExperimentalWarning: Module mocking is an experimental feature and might change at any time
(Use `node --trace-warnings ...` to show where the warning was created)

✔ addOrderItems: valid cart -> 201 with persisted order body (3.0979ms)

✔ addOrderItems: orderItems:[] -> 400 "No order items", no save (0.4297ms)
✔ addOrderItems: client-supplied totalPrice 0.01 is persisted verbatim (3

[Killed] BlockStatement
backend/controllers/orderController.js:56:10
       throw new Error('Not authorized to view this order')
     }
     res.json(order)
-  } else {
-    res.status(404)
-    throw new Error('Order not found')
-  }
+  } else {}
 })
 
killedBy: All tests
statusReason: (node:18596) ExperimentalWarning: Module mocking is an experimental feature and might change at any time
(Use `node --trace-warnings ...` to show where the warning was created)

✔ addOrderItems: valid cart -> 201 with persisted order body (2.3495ms)

✔ addOrderItems: orderItems:[] -> 400 "No order items", no save (0.4178ms)

✔ addOrderItems: client-supplied totalPrice 0.01 is persisted verbatim

[Killed] BlockStatement
backend/controllers/orderController.js:65:60
 // @desc    Update order to paid
 // @route   GET /api/orders/:id/pay
 // @access  Private
-const updateOrderToPaid = asyncHandler(async (req, res) => {
-  const order = await Order.findById(req.params.id)
-
-  if (order) {
-    order.isPaid = true
-    order.paidAt = Date.now()
-    order.paymentResult = {
-      id: req.body.id,
-      status: req.body.status,
-      update_time: req.body.update_time,
-      email_address: req.body.payer.email_address,
-    }
-
-    const updatedOrder = await order.save()
-
-    res.json(updatedOrder)
-  } else {
-    res.status(404)
-    throw new Error('Order not found')
-  }
-})
+const updateOrderToPaid = asyncHandler(async (req, res) => {})
 
 // @desc    Update order to delivered
killedBy: All tests
statusReason: (node:17744) ExperimentalWarning: Module mocking is an experimental feature and might change at any time
(Use `node --trace-warnings ...` to show where the warning was created)

✔ addOrderItems: valid cart -> 201 with persisted order body (1.9373ms)
✔ addOrderItems: orderItems:[] -> 400 "No order items", no save (0.3723ms)
✔ addOrderItems: client-supplied totalPrice 0.01 is persisted verbatim (0.

[Killed] BooleanLiteral
backend/controllers/orderController.js:69:20
   const order = await Order.findById(req.params.id)
 
   if (order) {
-    order.isPaid = true
+    order.isPaid = false
     order.paidAt = Date.now()
     order.paymentResult = {
killedBy: All tests
statusReason: (node:27224) ExperimentalWarning: Module mocking is an experimental feature and might change at any time
(Use `node --trace-warnings ...` to show where the warning was created)

✔ addOrderItems: valid cart -> 201 with persisted order body (2.1316ms)

✔ addOrderItems: orderItems:[] -> 400 "No order items", no save (0.4157ms)

✔ addOrderItems: client-supplied totalPrice 0.01 is persisted verbatim

[Killed] BlockStatement
backend/controllers/orderController.js:81:10
     const updatedOrder = await order.save()
 
     res.json(updatedOrder)
-  } else {
-    res.status(404)
-    throw new Error('Order not found')
-  }
+  } else {}
 })
 
killedBy: All tests
statusReason: (node:10976) ExperimentalWarning: Module mocking is an experimental feature and might change at any time
(Use `node --trace-warnings ...` to show where the warning was created)

✔ addOrderItems: valid cart -> 201 with persisted order body (1.9738ms)
✔ addOrderItems: orderItems:[] -> 400 "No order items", no save (0.3937ms)

✔ addOrderItems: client-supplied totalPrice 0.01 is persisted verbatim (

[Killed] BlockStatement
backend/controllers/orderController.js:90:65
 // @desc    Update order to delivered
 // @route   GET /api/orders/:id/deliver
 // @access  Private/Admin
-const updateOrderToDelivered = asyncHandler(async (req, res) => {
-  const order = await Order.findById(req.params.id)
-
-  if (order) {
-    order.isDelivered = true
-    order.deliveredAt = Date.now()
-
-    const updatedOrder = await order.save()
-
-    res.json(updatedOrder)
-  } else {
-    res.status(404)
-    throw new Error('Order not found')
-  }
-})
+const updateOrderToDelivered = asyncHandler(async (req, res) => {})
 
 // @desc    Get logged in user orders
killedBy: All tests
statusReason: (node:7192) ExperimentalWarning: Module mocking is an experimental feature and might change at any time
(Use `node --trace-warnings ...` to show where the warning was created)

✔ addOrderItems: valid cart -> 201 with persisted order body (2.8517ms)

✔ addOrderItems: orderItems:[] -> 400 "No order items", no save (0.4007ms)
✔ addOrderItems: client-supplied totalPrice 0.01 is persisted verbatim (0

[Killed] BooleanLiteral
backend/controllers/orderController.js:94:25
   const order = await Order.findById(req.params.id)
 
   if (order) {
-    order.isDelivered = true
+    order.isDelivered = false
     order.deliveredAt = Date.now()
 
killedBy: All tests
statusReason: (node:20176) ExperimentalWarning: Module mocking is an experimental feature and might change at any time
(Use `node --trace-warnings ...` to show where the warning was created)

✔ addOrderItems: valid cart -> 201 with persisted order body (1.9756ms)
✔ addOrderItems: orderItems:[] -> 400 "No order items", no save (0.3916ms)
✔ addOrderItems: client-supplied totalPrice 0.01 is persisted verbatim (0.

[Killed] BlockStatement
backend/controllers/orderController.js:109:54
 // @desc    Get logged in user orders
 // @route   GET /api/orders/myorders
 // @access  Private
-const getMyOrders = asyncHandler(async (req, res) => {
-  const orders = await Order.find({ user: req.user._id })
-  res.json(orders)
-})
+const getMyOrders = asyncHandler(async (req, res) => {})
 
 // @desc    Get all orders
killedBy: All tests
statusReason: (node:2548) ExperimentalWarning: Module mocking is an experimental feature and might change at any time
(Use `node --trace-warnings ...` to show where the warning was created)

✔ addOrderItems: valid cart -> 201 with persisted order body (1.8995ms)

✔ addOrderItems: orderItems:[] -> 400 "No order items", no save (0.3809ms)

✔ addOrderItems: client-supplied totalPrice 0.01 is persisted verbatim

[Killed] ObjectLiteral
backend/controllers/orderController.js:110:35
 // @route   GET /api/orders/myorders
 // @access  Private
 const getMyOrders = asyncHandler(async (req, res) => {
-  const orders = await Order.find({ user: req.user._id })
+  const orders = await Order.find({})
   res.json(orders)
 })
killedBy: All tests
statusReason: (node:10020) ExperimentalWarning: Module mocking is an experimental feature and might change at any time
(Use `node --trace-warnings ...` to show where the warning was created)

✔ addOrderItems: valid cart -> 201 with persisted order body (2.0091ms)

✔ addOrderItems: orderItems:[] -> 400 "No order items", no save (0.3808ms)
✔ addOrderItems: client-supplied totalPrice 0.01 is persisted verbatim (

[Killed] BlockStatement
backend/controllers/orderController.js:117:52
 // @desc    Get all orders
 // @route   GET /api/orders
 // @access  Private/Admin
-const getOrders = asyncHandler(async (req, res) => {
-  const orders = await Order.find({}).populate('user', 'id name')
-  res.json(orders)
-})
+const getOrders = asyncHandler(async (req, res) => {})
 
 export {
killedBy: All tests
statusReason: (node:6668) ExperimentalWarning: Module mocking is an experimental feature and might change at any time
(Use `node --trace-warnings ...` to show where the warning was created)

✔ addOrderItems: valid cart -> 201 with persisted order body (2.0213ms)

✔ addOrderItems: orderItems:[] -> 400 "No order items", no save (0.3697ms)

✔ addOrderItems: client-supplied totalPrice 0.01 is persisted verbatim

[Killed] StringLiteral
backend/controllers/orderController.js:118:56
 // @route   GET /api/orders
 // @access  Private/Admin
 const getOrders = asyncHandler(async (req, res) => {
-  const orders = await Order.find({}).populate('user', 'id name')
+  const orders = await Order.find({}).populate('user', "")
   res.json(orders)
 })
killedBy: All tests
statusReason: (node:28272) ExperimentalWarning: Module mocking is an experimental feature and might change at any time
(Use `node --trace-warnings ...` to show where the warning was created)

✔ addOrderItems: valid cart -> 201 with persisted order body (1.9273ms)
✔ addOrderItems: orderItems:[] -> 400 "No order items", no save (0.3411ms)

✔ addOrderItems: client-supplied totalPrice 0.01 is persisted verbatim (

[Killed] StringLiteral
backend/controllers/orderController.js:118:48
 // @route   GET /api/orders
 // @access  Private/Admin
 const getOrders = asyncHandler(async (req, res) => {
-  const orders = await Order.find({}).populate('user', 'id name')
+  const orders = await Order.find({}).populate("", 'id name')
   res.json(orders)
 })
killedBy: All tests
statusReason: (node:1228) ExperimentalWarning: Module mocking is an experimental feature and might change at any time
(Use `node --trace-warnings ...` to show where the warning was created)

✔ addOrderItems: valid cart -> 201 with persisted order body (2.3289ms)

✔ addOrderItems: orderItems:[] -> 400 "No order items", no save (0.3827ms)
✔ addOrderItems: client-supplied totalPrice 0.01 is persisted verbatim (0
